# Proyek Analisis Data: Bike Sharing Dataset
- **Nama:** Maulana Surya Negara
- **Email:** maulanasuryanegara123@gmail.com
- **ID Dicoding:** mausneg

## Menentukan Pertanyaan Bisnis

- Pertanyaan 1 : Apakah ada perbedaan yang signifikan dalam jumlah peminjaman sepeda antara hari kerja, akhir pekan, dan hari libur?
- Pertanyaan 2 : Bagaimana pengaruh musim terhadap jumlah peminjaman sepeda?
- Pertanyaan 3 : Apakah ada hubungan antara suhu, kelembapan, dan kecepatan angin dengan jumlah peminjaman sepeda?
- Pertanyaan 4 : Pada jam berapa jumlah peminjaman sepeda paling tinggi?
- Pertanyaan 5 : Bagaimana perbandingan jumlah peminjaman sepeda antara pengguna terdaftar (registered) dan kasual (casual), serta bagaimana tren penggunaan sepeda oleh kedua jenis pengguna dari tahun 2011 ke 2012?

## Import Semua Packages/Library yang Digunakan

In [62]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Data Wrangling

### Gathering Data

In [63]:
df_day = pd.read_csv('data/day.csv')
df_hour = pd.read_csv('data/hour.csv')

Melakukan import dataset Bike Sharing yang terdiri dari data day dan hour ke dalam bentuk dataframe pandas.

### Assessing Data

Melakukan pemeriksaan data untuk melihat apakah ada data yang hilang, duplikat, dan tipe data yang tidak sesuai pada setiap tabel. Jika ada, lakukan penanganan yang sesuai seperti menghapus data duplikat, mengisi data yang hilang, dan mengubah tipe data yang tidak sesuai.

#### Data Day

In [64]:
df_day.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 731 entries, 0 to 730
Data columns (total 16 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     731 non-null    int64
 1   dteday      731 non-null    object
 2   season      731 non-null    int64
 3   yr          731 non-null    int64
 4   mnth        731 non-null    int64
 5   holiday     731 non-null    int64
 6   weekday     731 non-null    int64
 7   workingday  731 non-null    int64
 8   weathersit  731 non-null    int64
 9   temp        731 non-null    float64
 10  atemp       731 non-null    float64
 11  hum         731 non-null    float64
 12  windspeed   731 non-null    float64
 13  casual      731 non-null    int64
 14  registered  731 non-null    int64
 15  cnt         731 non-null    int64
dtypes: float64(4), int64(11), object(1)
memory usage: 91.5+ KB

Dari `info()` kita bisa melihat bahwa tidak ada data yang hilang dan tipe data sudah sesuai. Namun, kita perlu mengubah tipe data `dteday` menjadi datetime agar lebih mudah dalam analisis waktu. Menghapus kolom `instant` karena tidak diperlukan dalam analisis.

In [65]:
print(f'Duplicate data: {df_day.duplicated().sum()}')
df_day.describe()

Duplicate data: 0

,instant,season,yr,mnth,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
count,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000,731.000000
mean,366.000000,2.496580,0.500684,6.519836,0.028728,2.997264,0.683995,1.395349,0.495385,0.474354,0.627894,0.190486,848.176471,3656.172367,4504.348837
std,211.165812,1.110807,0.500342,3.451913,0.167155,2.004787,0.465233,0.544894,0.183051,0.162961,0.142429,0.077498,686.622488,1560.256377,1937.211452
min,1.000000,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,1.000000,0.059130,0.079070,0.000000,0.022392,2.000000,20.000000,22.000000
25%,183.500000,2.000000,0.000000,4.000000,0.000000,1.000000,0.000000,1.000000,0.337083,0.337842,0.520000,0.134950,315.500000,2497.000000,3152.000000
50%,366.000000,3.000000,1.000000,7.000000,0.000000,3.000000,1.000000,1.000000,0.498333,0.486733,0.626667,0.180975,713.000000,3662.000000,4548.000000
75%,548.500000,3.000000,1.000000,10.000000,0.000000,5.000000,1.000000,2.000000,0.655417,0.608602,0.730209,0.233214,1096.000000,4776.500000,5956.000000
max,731.000000,4.000000,1.000000,12.000000,1.000000,6.000000,1.000000,3.000000,0.861667,0.840896,0.972500,0.507463,3410.000000,6946.000000,8714.000000

Dari output di atas terlihat tidak terdapat data yang duplicate. Tetapi pada column `windspeed` value max memiliki nilai yang cukup jauh dari value 75% nya, sehingga kita perlu melakukan pengecekan lebih lanjut pada column tersebut. Kita juga perlu megembalikan nilai `temp` dan `atemp` ke nilai semula yaitu celcius.

#### Data Hour

In [66]:
df_hour.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 17 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   instant     17379 non-null  int64
 1   dteday      17379 non-null  object
 2   season      17379 non-null  int64
 3   yr          17379 non-null  int64
 4   mnth        17379 non-null  int64
 5   hr          17379 non-null  int64
 6   holiday     17379 non-null  int64
 7   weekday     17379 non-null  int64
 8   workingday  17379 non-null  int64
 9   weathersit  17379 non-null  int64
 10  temp        17379 non-null  float64
 11  atemp       17379 non-null  float64
 12  hum         17379 non-null  float64
 13  windspeed   17379 non-null  float64
 14  casual      17379 non-null  int64
 15  registered  17379 non-null  int64
 16  cnt         17379 non-null  int64
dtypes: float64(4), int64(12), object(1)
memory usage: 2.3+ MB

Dari `info()` kita bisa melihat bahwa tidak ada data yang hilang dan tipe data sudah sesuai. Namun, kita perlu mengubah tipe data `dteday` menjadi datetime agar lebih mudah dalam analisis waktu. Menghapus kolom `instant` karena tidak diperlukan dalam analisis.

In [67]:
print(f'Duplicate data: {df_hour.duplicated().sum()}')
df_hour.describe()

Duplicate data: 0

,instant,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
count,17379.0000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000,17379.000000
mean,8690.0000,2.501640,0.502561,6.537775,11.546752,0.028770,3.003683,0.682721,1.425283,0.496987,0.475775,0.627229,0.190098,35.676218,153.786869,189.463088
std,5017.0295,1.106918,0.500008,3.438776,6.914405,0.167165,2.005771,0.465431,0.639357,0.192556,0.171850,0.192930,0.122340,49.305030,151.357286,181.387599
min,1.0000,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,1.000000,0.020000,0.000000,0.000000,0.000000,0.000000,0.000000,1.000000
25%,4345.5000,2.000000,0.000000,4.000000,6.000000,0.000000,1.000000,0.000000,1.000000,0.340000,0.333300,0.480000,0.104500,4.000000,34.000000,40.000000
50%,8690.0000,3.000000,1.000000,7.000000,12.000000,0.000000,3.000000,1.000000,1.000000,0.500000,0.484800,0.630000,0.194000,17.000000,115.000000,142.000000
75%,13034.5000,3.000000,1.000000,10.000000,18.000000,0.000000,5.000000,1.000000,2.000000,0.660000,0.621200,0.780000,0.253700,48.000000,220.000000,281.000000
max,17379.0000,4.000000,1.000000,12.000000,23.000000,1.000000,6.000000,1.000000,4.000000,1.000000,1.000000,1.000000,0.850700,367.000000,886.000000,977.000000

Dari output di atas terlihat tidak terdapat data yang duplicate. Tetapi pada column `windspeed` value max memiliki nilai yang cukup jauh dari value 75% nya, sehingga kita perlu melakukan pengecekan lebih lanjut pada column tersebut. Kita juga perlu megembalikan nilai `temp` dan `atemp` ke nilai semula yaitu celcius.

### Cleaning Data

#### Data Day

Langkah pertama mengubah tipe data `dteday` menjadi datetime agar lebih mudah dalam analisis waktu. Selain itu kita juga akan menghapus column `instant` karena tidak diperlukan dalam analisis ini.

In [68]:
df_day['dteday'] = pd.to_datetime(df_day['dteday'])

In [69]:
df_day.drop(columns=['instant'], inplace=True)

In [70]:
df_day.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 731 entries, 0 to 730
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   dteday      731 non-null    datetime64[ns]
 1   season      731 non-null    int64
 2   yr          731 non-null    int64
 3   mnth        731 non-null    int64
 4   holiday     731 non-null    int64
 5   weekday     731 non-null    int64
 6   workingday  731 non-null    int64
 7   weathersit  731 non-null    int64
 8   temp        731 non-null    float64
 9   atemp       731 non-null    float64
 10  hum         731 non-null    float64
 11  windspeed   731 non-null    float64
 12  casual      731 non-null    int64
 13  registered  731 non-null    int64
 14  cnt         731 non-null    int64
dtypes: datetime64[ns](1), float64(4), int64(10)
memory usage: 85.8 KB

Dari `info()` kita bisa melihat bahwa tipe data `dteday` sudah berubah menjadi datetime dan column `instant` sudah dihapus.

Selanjutnya kita akan melakukan pengecekan pada column `windspeed` yang memiliki nilai max yang cukup jauh dari value 75% nya. Kita akan melakukan pengecekan lebih lanjut untuk melihat apakah ada outlier pada column tersebut.

In [71]:
df_day[df_day['windspeed'].max() == df_day['windspeed']].head()

,dteday,season,yr,mnth,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
49,2011-02-19,1,0,2,0,6,0,1,0.399167,0.391404,0.187917,0.507463,532,1103,1635

In [72]:
df_day.sort_values(by='windspeed', ascending=False).head(10)

,dteday,season,yr,mnth,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
49,2011-02-19,1,0,2,0,6,0,1,0.399167,0.391404,0.187917,0.507463,532,1103,1635
432,2012-03-08,1,1,3,0,4,1,1,0.527500,0.524604,0.567500,0.441563,486,4896,5382
292,2011-10-20,4,0,10,0,4,1,1,0.475833,0.466525,0.636250,0.422275,471,3724,4195
420,2012-02-25,1,1,2,0,6,0,1,0.290833,0.255675,0.395833,0.421642,317,2415,2732
44,2011-02-14,1,0,2,0,1,1,1,0.415000,0.398350,0.375833,0.417908,208,1705,1913
382,2012-01-18,1,1,1,0,3,1,1,0.303333,0.275254,0.443333,0.415429,109,3267,3376
433,2012-03-09,1,1,3,0,5,1,2,0.410833,0.397083,0.407083,0.414800,447,4122,4569
407,2012-02-12,1,1,2,0,0,0,1,0.127500,0.101658,0.464583,0.409212,73,1456,1529
721,2012-12-22,1,1,12,0,6,0,1,0.265833,0.236113,0.441250,0.407346,205,1544,1749
666,2012-10-28,4,1,10,0,0,0,2,0.477500,0.467771,0.694583,0.398008,998,3461,4459

Dari output di atas nilai yang besar tersebut adalah nilai yang wajar jika dibandingkan dengan nilai lainnya. Sehingga kita perlu melakukan pengecekan lebih lanjut pada column tersebut dengan menggunakan data `hour`.

Terakhir kita akan mengembalikan nilai `temp` dan `atemp` ke nilai semula yaitu celcius.

In [73]:
t_min = -8
t_max = 39
at_min = -16
at_max = 50

df_day['temp_original'] = df_day['temp'] * (t_max - t_min) + t_min
df_day['atemp_original'] = df_day['atemp'] * (at_max - at_min) + at_min

#### Data Hour

Hal yang sama juga dilakukan pada data hour, kita akan mengubah tipe data `dteday` menjadi datetime agar lebih mudah dalam analisis waktu. Selain itu kita juga akan menghapus column `instant` karena tidak diperlukan dalam analisis ini.

In [74]:
df_hour['dteday'] = pd.to_datetime(df_hour['dteday'])

In [75]:
df_hour.drop(columns=['instant'], inplace=True)

In [76]:
df_hour.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17379 entries, 0 to 17378
Data columns (total 16 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   dteday      17379 non-null  datetime64[ns]
 1   season      17379 non-null  int64
 2   yr          17379 non-null  int64
 3   mnth        17379 non-null  int64
 4   hr          17379 non-null  int64
 5   holiday     17379 non-null  int64
 6   weekday     17379 non-null  int64
 7   workingday  17379 non-null  int64
 8   weathersit  17379 non-null  int64
 9   temp        17379 non-null  float64
 10  atemp       17379 non-null  float64
 11  hum         17379 non-null  float64
 12  windspeed   17379 non-null  float64
 13  casual      17379 non-null  int64
 14  registered  17379 non-null  int64
 15  cnt         17379 non-null  int64
dtypes: datetime64[ns](1), float64(4), int64(11)
memory usage: 2.1 MB

Dari `info()` kita bisa melihat bahwa tipe data `dteday` sudah berubah menjadi datetime dan column `instant` sudah dihapus.

Selanjutnya kita akan melakukan pengecekan pada column `windspeed` yang memiliki nilai max yang cukup jauh dari value 75% nya. Kita akan melakukan pengecekan lebih lanjut untuk melihat apakah ada outlier pada column tersebut.

In [77]:
df_hour[df_hour['windspeed'].max() == df_hour['windspeed']]

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
4315,2011-07-03,3,0,7,17,0,0,0,3,0.8,0.7424,0.49,0.8507,181,177,358
4316,2011-07-03,3,0,7,18,0,0,0,3,0.8,0.7424,0.49,0.8507,74,107,181

In [78]:
df_hour.sort_values(by='windspeed', ascending=False).head(10)

,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
4316,2011-07-03,3,0,7,18,0,0,0,3,0.80,0.7424,0.49,0.8507,74,107,181
4315,2011-07-03,3,0,7,17,0,0,0,3,0.80,0.7424,0.49,0.8507,181,177,358
5635,2011-08-27,3,0,8,17,0,6,0,3,0.64,0.5758,0.89,0.8358,2,14,16
1259,2011-02-25,1,0,2,15,0,5,1,1,0.46,0.4545,0.41,0.8060,5,50,55
9956,2012-02-24,1,1,2,21,0,5,1,1,0.42,0.4242,0.35,0.8060,1,151,152
1017,2011-02-15,1,0,2,1,0,2,1,1,0.30,0.2424,0.42,0.7761,0,5,5
1261,2011-02-25,1,0,2,17,0,5,1,1,0.32,0.2727,0.49,0.7463,8,181,189
1125,2011-02-19,1,0,2,15,0,6,0,1,0.44,0.4394,0.16,0.7463,84,87,171
9653,2012-02-12,1,1,2,4,0,0,0,2,0.10,0.0455,0.46,0.7164,0,1,1
11024,2012-04-09,2,1,4,12,0,1,1,1,0.54,0.5152,0.28,0.7164,94,186,280

Dari output di atas ternyata banyak data juga yang memiliki nilai `windspeed` terbilang tinggi, sehingga hal ini bukanlah suatu anomali jadi kita tidak perlu melakukan penanganan lebih lanjut pada column tersebut.

Terakhir kita akan mengembalikan nilai `temp` dan `atemp` ke nilai semula yaitu celcius.

In [79]:
df_hour['temp_original'] = df_hour['temp'] * (t_max - t_min) + t_min
df_hour['atemp_original'] = df_hour['atemp'] * (at_max - at_min) + at_min

## Exploratory Data Analysis (EDA)

### Day Type

Langkah pertama adalah melakukan pengelompokan data berdasarkan `workingday`, `holiday`, dan `weekday`. Kemudian kita akan menghitung jumlah peminjaman sepeda untuk masing-masing kelompok tersebut.

In [80]:
df_working_holiday = df_day.groupby(['workingday', 'holiday']).agg({
    'cnt': 'sum',
    'casual': 'sum',
    'registered': 'sum'    
}).reset_index()
df_working_holiday

   workingday  holiday      cnt  casual  registered
0           0        0   921834  294373      627461
1           0        1    78435   22359       56076
2           1        0  2292410  303285     1989125

Selanjutnya kita akan melakukan labeling pada column `workingday` dan `holiday` agar lebih mudah dalam analisis.

In [81]:
df_working_holiday['day_type'] = df_working_holiday.apply(
    lambda row: 'weekend' if row['workingday'] == 0 and row['holiday'] == 0 else 
                'holiday' if row['holiday'] == 1 else 
                'working', axis=1
)
df_working_holiday.drop(columns=['workingday', 'holiday'], inplace=True)
df_working_holiday

       cnt  casual  registered day_type
0   921834  294373      627461  weekend
1    78435   22359       56076  holiday
2  2292410  303285     1989125  working

Dari output di atas bisa kita lihat jumlah peminjaman sepeda pada hari kerja, akhir pekan, dan hari libur sudah dikelompokkan.

### Weather

Selanjutnya kita akan melakukan pengelompokan data berdasarkan `weather` dan menghitung jumlah peminjaman sepeda untuk masing-masing kelompok tersebut. Dikarenakan pada satu hari bisa terjadi lebih dari satu cuaca, maka kita akan menggunakan data `hour` untuk melakukan pengelompokan ini.

In [82]:
df_weather = df_hour.groupby(['weathersit']).agg({
    'cnt': 'sum',
    'casual': 'sum',
    'registered': 'sum'    
}).reset_index()
df_weather

   weathersit      cnt  casual  registered
0           1  2338173  462745     1875428
1           2   795952  134481      661471
2           3   158331   22783      135548
3           4      223       8         215

Lalu kita akan melakukan labeling pada column `weather` agar lebih mudah dalam analisis.

In [83]:
df_weather['weather'] = df_weather.apply(
    lambda row: 'clear_cloudy' if row['weathersit'] == 1 else 
                'mist_cloudy' if row['weathersit'] == 2 else 
                'light_rain_snow' if row['weathersit'] == 3 else 
                'heavy_rain_snow_fog', axis=1
)
df_weather.drop(columns=['weathersit'], inplace=True)
df_weather

       cnt  casual  registered              weather
0  2338173  462745     1875428         clear_cloudy
1   795952  134481      661471          mist_cloudy
2   158331   22783      135548      light_rain_snow
3      223       8         215  heavy_rain_snow_fog

Dari output di atas bisa kita lihat jumlah peminjaman sepeda pada masing-masing cuaca sudah dikelompokkan.

### Hour Distribution

Selanjutnya kita akan melakukan menghitung jumlah peminjaman sepeda berdasarkan jam. Kita akan menggunakan data `hour` untuk melakukan pengelompokan ini. Agar terfokus pada jam saja kita hanya akan menggunakan kolom `hr` dan `cnt` saja

In [101]:
df_hour_type = df_hour.groupby(['hr']).agg({
    'cnt': 'sum'
}).reset_index()
df_hour_type

    hr     cnt
0    0   39130
1    1   24164
2    2   16352
3    3    8174
4    4    4428
5    5   14261
6    6   55132
7    7  154171
8    8  261001
9    9  159438
10  10  126257
11  11  151320
12  12  184414
13  13  184919
14  14  175652
15  15  183149
16  16  227748
17  17  336860
18  18  309772
19  19  226789
20  20  164550
21  21  125445
22  22   95612
23  23   63941

Dari output di atas sudah terlihat bagaimana distribusi peminjaman sepeda berdasarkan jam.

## Visualization & Explanatory Analysis

### Pertanyaan 1: Apakah ada perbedaan yang signifikan dalam jumlah peminjaman sepeda antara hari kerja, akhir pekan, dan hari libur?

### Pertanyaan 2 : Bagaimana pengaruh musim terhadap jumlah peminjaman sepeda?

### Pertanyaan 3 : Apakah ada hubungan antara suhu, kelembapan, dan kecepatan angin dengan jumlah peminjaman sepeda?

### Pertanyaan 4 : Pada jam berapa jumlah peminjaman sepeda paling tinggi?

### Pertanyaan 5 : Bagaimana perbandingan jumlah peminjaman sepeda antara pengguna terdaftar (registered) dan kasual (casual), serta bagaimana tren penggunaan sepeda oleh kedua jenis pengguna dari tahun 2011 ke 2012?

## Analisis Lanjutan (Opsional)

## Conclusion

- Conclution pertanyaan 1
- Conclution pertanyaan 2